{
  "https://www.v2ex.com/feed/tab/tech.xml": [
    {
      "title": "如何制作 Linux live cd",
      "link": "https://www.v2ex.com/t/1152913#reply13",
      "summary": "虽然说各 linux 发行版带有 live 模式，但是它们的 live 模式都是英文，我想换成中文，或者添加自己的工具或软件进去 请教各位大佬，如何制作 linux live cd ？需要什么工具？",
      "published": "2025-08-16T15:26:19Z",
      "fetch_time": "2025-08-17T10:16:32.126052"
    },
    {
      "title": "程序员应该怎么跟别人吵架？",
      "link": "https://www.v2ex.com/t/1152915#reply12",
      "summary": "我不刷微博不刷抖音，也不在网上跟别人吵架8 月 14 号，逛 v2 看到一篇比人的推广，点进去看了下 是个推广 claude code 镜像站点服务的网站，注册了一个送了点积分，用手上的一个小仓库用了体验了一下没啥毛病，比网页上面用起来好使 这是背景 8 月 15 号送的积分用完了，在用了下没啥毛病的基础上于是我花 89 块钱开了个周套餐继续体验一下 真开了的 今天手欠，多逛了一下他们的网站，看了下，看到了一个 点进去，欸是个企微群，好吧，进去，进去了我啥也没说，就看看 直到一会看到这群里面的一个人发了个消息 我好奇点开看了下他分享的聊天记录 我觉得这里逻辑上可能存在一点问题，于是回复了一句 方便各位看官吃瓜，下面是完整的聊天记录 我擦，这人这么屌的吗？古井的心中泛起一丝泼蓝~~我加了这个很屌的群主，他同意后给我甩了一张截图 别人用不了了不叫产品问题吗？既然产品问题要私聊解决那么你们又搞个群聊开启干什么呢？ look up my eyes ，回答我！ 于是我拉了个表格，回了一张图给他 tell me baby, why?why?why? 积分规则在哪里呢？群公告里？ 你这么会制定规则，那你用你卖的别人的产品问问常见的规则是怎么制定的，看看是怎么说的 什么叫你送的，你送你奶奶个腿 你奶奶的锤子，你当前实际上用的就是这种方式，什么叫是你送的，这本来就是对应套餐时效期内的 可以用 8 天，8 天，哥，大哥，周卡 7 天你让大家伙用了 8 天，您太仁慈了 最后，我用你发的话再回复你吧 <center style=\"margin-top:-1.6rem;\"></center> 这把匹配赛，竟然让我匹配到了你这个屌人，我特么必须当场就给你骂回去，不然下次匹配不到了！ rnmd ，浪费我宝贵的几十分钟（发个帖也特么有点浪费时间，但是我不说不痛快，苟东溪误我）我的修养还是不到位。没有跟别人网上对喷的经验，请问遇到这种屌人应该怎么办？ 各位 V 友，请问我有错吗？请问上面的程序算法有错吗？元芳，如果是你，你怎么办？ 完整记录 https://tc-cdn.processon.com/wps/68a09bd5871d961ff23b81bf （这个前面已经贴了，切图太麻烦了我就不一个个图切了） https://tc-cdn.processon.com/wps/68a09c9a0d26e41384153739 （这个前面没贴） 第一次发帖，不确定有没有遵守到 v2 的规则，如果有算法不对的地方请告诉我，还请管理员不要 t 我",
      "published": "2025-08-16T15:43:38Z",
      "fetch_time": "2025-08-17T10:16:32.127459"
    },
    {
      "title": "有没有 MacBook Air 品质的 Linux 笔记本？",
      "link": "https://www.v2ex.com/t/1152760#reply54",
      "summary": "可以自己加大内存，无风扇设计。",
      "published": "2025-08-15T14:37:11Z",
      "fetch_time": "2025-08-17T10:16:32.127523"
    },
    {
      "title": "国产安卓如何禁止微信自动加入电池优化白名单？",
      "link": "https://www.v2ex.com/t/1152940#reply0",
      "summary": "每次手动电池优化微信，过一段时间又自动取消电池优化了。不想让毒瘤微信一直在后台偷电。实测电池优化了微信消息最多延迟 1 分钟左右。如何禁止系统擅自把微信加入白名单呢。最好不 root 用 adb 就能一劳永逸的方法。",
      "published": "2025-08-17T02:33:44Z",
      "fetch_time": "2025-08-17T10:39:16.291194"
    }
  ],
  "http://feeds.feedburner.com/ruanyifeng": [
    {
      "title": "科技爱好者周刊（第 361 期）：暗网 Tor 安全吗？",
      "link": "http://www.ruanyifeng.com/blog/2025/08/weekly-issue-361.html",
      "summary": "这里记录每周值得分享的科技内容，周五发布。 本杂志开源，欢迎投稿。另有《谁在招人》服务，发布程序员招聘信息。合作请邮件联系（yifeng.ruan@gmail.com）。 封面图 去年建成开放的烟台时光塔，是一个海边的文化建筑，下层是露天剧场，中间是望海平台，上层是图书馆、展览厅、咖啡馆。（via） 暗网 Tor 安全吗？ 1、 大家知道 Tor 浏览器吧？ 它是访问暗网（dark web）的主要工具。 所谓暗网，就是普通浏览器打不开、必须用专门工具访问的互联网。 之所以暗网要用专门工具访问，是因为它采用了特殊的设计，保证让访问者高度匿名，难以追踪。 如果你希望执行秘密的互联网操作，就可以使用暗网。同样的，地下网站希望保密，不愿意暴露自己，那就可以做一个暗网版本，正常互联网无法访问。 暗网有专门域名 .onion，这种域名的网站都是要用 Tor 打开的。 2、 我一直以为 Tor/暗网很安全，可以保证访问者的匿名，无法找到真人。 因为它的设计是防追踪的。它不是直接访问目标网址，而是寻找一个随机的中继节点。 它规定，必须通过3个中继节点，才能连接目标网站。每个中继节点，只知道上一个节点和下一个节点，因此该节点即使被黑，黑客也看不到完整的通信线路。 理论上，只有三个中继节点都被破解，才能追踪用户。但是，这些节点是在全世界随机选择的，全被破解的概率实在很低。 这种设计叫做\"洋葱路由\"，就像剥洋葱一样，必须一层层解开所有的中继节点，才能了解完整的访问链路。事实上，Tor 这个词就是洋葱路由（The Onion Router）的首字母缩写。 3、 上周，我读到一篇文章，彻底动摇了对 Tor 的信心。 我震惊地发现，Tor 是美国政府开发的。 1997年，美国海军研究实验室（NRL）发明了 Tor。最初的动机是，防止外国政府追踪美国的机密通信。 美国的情报人员在国外，要向中情局的服务器发送机密消息，不希望被外国政府察觉和追踪，但又必须使用外国的民用线路，怎么办？ 答案就是 Tor。通过洋葱路由，Tor 可以在民用通信线路上，让外国的互联网提供商无法找到人员位置和目标网址。 2004年，美国政府公开了这个项目的源码。电子前沿基金会 (EFF) 接手继续开发，逐渐演变成今天的 Tor，但是底层设计并没有大的改动。 开源之后，美国政府并没有放手这个项目，多年来一直大力资助。2012年，Tor 项目的年度预算200万美元，80%来自美国政府。 我查了最新的2023～2024年度财务报表，790多万的总收入中，依然有200多万来自政府。 美国政府大力资助 Tor，是因为这个项目对他们有利用价值。 我相信，Tor 源码应该是可靠的，没有植入后门，毕竟它是开源的，要经受全世界程序员的审查。但是，美国政府肯定了解源码的所有细节，很可能会部署他们自己修改过的版本，添加一些不为人知的改动。 根据以前透露的消息，很多的 Tor 中继节点是美国政府架设的（具体比例无法查实）。所以我认为，不能假设 Tor 是安全的，美国政府很可能监视 Tor 的通信。 曾经非常著名的暗网黑市网站\"丝绸之路\"（上图），就是完全依托于 Tor 来访问。但是，2013年被美国政府查封，创始人也被抓了。这也从一个侧面说明，Tor 并不安全。 科技动态 1、上周，中国的载人月球登陆器\"揽月\"，在河北省怀来县进行了着陆起飞测试。 它挂在一个钢盘下面，钢盘使用钢索牵引，可以上下运动，用来模拟月球引力。 2、美国宾州大学发布了一个演示，监视手机通话时的微小震动，可以还原出通话内容。 手机通话时，扬声器会震动，通过激光雷达，在3米外监视手机，可以感受到这种震动，从而还原出语音。 再通过 Whisper 模型，将语音转成文字，就能得到通话内容，准确率为60%。 3、一位美国程序员，制作了一个木质的像素显示器。 这个显示器的每个像素点，都是一个小木块，有一面涂黑。 显示器的控制器是一个树莓派，收到显示图案后，计算出哪些木块需要转动，然后驱动一个机械臂转动这些木块。 最后的显示效果如下。 4、谷歌披露，安卓系统内置了一个全球地震预警系统，可以向用户发出地震警报。 安卓手机都有加速度计，就是手机横置时让屏幕翻转的那种传感器，它可以侦测到手机的移动。 如果系统发现，同一个地理区域的手机突然同时震动，就说明地震了。谷歌就会向该区域的用户推送地震警报。 该系统于2021年4月，首先在新西兰和希腊上线，已覆盖98个国家/地区。2023年11月的菲律宾6.7级地震，2023年11月的尼泊尔5.7级地震，它都发送了警报。 5、人类为什么需要睡眠？最近一篇论文指出，睡眠与细胞线粒体有关。 在有氧状态下，线粒体的不间断活动会导致自身裂变，所以需要一个静止期（睡眠）来修复，并补充能量。 结论就是，只要生物需要氧气，就需要睡眠，因为有氧活动会消耗线粒体。 文章 1、锚点定位简介（英文） CSS 的新语法\"锚点定位\"（anchor position），可以不使用 JavaScript，只用 CSS 就完成弹出菜单对某个锚点元素<a>的定位。 2、使用 Rclone 挂载网盘到本地（英文） 本文介绍使用 Rclone 这个工具，将网盘（比如微软的 OneDrive），挂载成一个本地目录。 3、如何选择英文字体（英文） 本文介绍选择合适的英文字体的一些注意点。 4、我的 NotebookLM 使用方法（英文） NotebookLM 是现在公认的最佳 AI 笔记工具，作者写了他的使用方法，用它来\"看\"没看过的电视剧，我觉得有参考价值。 5、Docker 运行图形界面软件的一种方法（英文） 本文介绍使用 Wayland 协议，把图形界面软件放在 Docker 容器运行。 6、为什么 π² ≈ g？（英文） π² 等于9.86，很接近重力加速度 g 的9.8。本文告诉你，这不是巧合，跟米的定义（北极到赤道的距离的百万分之一）有关。 工具 1、Battery 一个 Macbook 笔记本的小工具，使得充电只能充到80%。 2、Readeck 一个自托管的 Web 应用，用来收藏书签，自动保存网页内容。 3、missing.css 一个 CSS 库，提供一套精简、可扩展的样式方案。 4、My idlers 一个自托管的 Web 应用，用来统一管理你的虚拟主机、共享主机和域名，参见介绍文章。 5、Kimu 基于 Web 的视频编辑器，支持接入 AI，代码开源。 6、vYinn（殷人） 古籍印章图案的制作工具。（@shanleiguang 投稿） 7、Call-Me 一个开源网站，在浏览器中实现一对一视频通话，有 Demo。（@miroslavpejic85 投稿） 8、Modern MD Editor 一个基于 Web 的 Markdown 编辑器，生成适配微信公众号/社交平台的可视化 HTML 代码。（@xiaobox 投稿） 另有一个使用 AI 生成的微信 Markdown 编辑器。（@geekjourneyx 投稿） 9、流畅阅读（FluentRead） 浏览器开源插件，\"沉浸式翻译\"的开源替代品，支持多种翻译引擎和 AI 大模型，提供双语翻译、划词翻译等特性。（@Bistutu 投稿） 10、Diff Excel 一个开源的桌面应用，用来比较两个 Excel 表格的差异，使用 Go 语言编写。（@zbuzhi 投稿） AI 相关 1、LLM from URL 将提问直接附在 URL 后面，对大模型提问，比如 818233.xyz/你是什么模型 。（@yvonuk 投稿） 2、AI Short Video Factory（短视频工厂） 一个开源的 Web 应用，上传视频素材，给出提示词，AI 自动生成短视频和文案。（@YILS-LIN 投稿） 3、Mapedia.cc AI 地图，用户搜索一个主题，它会显示相关地图和解释文章，比如苏东坡的地图。（@klemperer 投稿） 资源 1、One Million Screenshots 这个网页号称由100万张网页截图组成，可以放大缩小查看。 2、Engineering.fyi 这个网站将各大互联网公司的技术文章（英文）收集在一起。 3、Touch Mapper 这个网站的创意很棒，你输入一个街道地址，它输出该地址的 3D 地图文件，可以 3D 打印出来，供视障人士触摸使用。 4、Pricing Pages Design 这个网站收集各种定价页的设计。 图片 1、古典雕像 + 当代时装 一位法国摄影师为古典雕塑，穿上流行的当代服饰。 这样的组合不仅有趣，还给人一种耳目一新的感觉。 这说明，一个人给别人的感觉和自身的气质，很大程度上与服装打扮有关。 文摘 1、我的技术退步了 五年前，我大学毕业时，很热衷于软件开发，参与了一大堆开源项目。 我全身心投入，为这些项目投入了数千小时。虽然没有回报，但我非常享受这些时间，项目用户也对我的工作评价很高。 毕业后，我开始找工作。我认为，公司会看重我的开源经历。我想错了。 我申请了600多个职位，告诉公司我为开源项目做了许多贡献，但结果只收到了3个 offer。最终，我接受了一家创业公司的 offer。 白天，我为这家创业公司工作八九个小时。回到家后，我继续投入自己的开源项目，直到深夜。 我的薪水少得可怜，但是我乐在其中。我的技能快速提高，社区影响力也显著提升。 终于有一天，我认清了现实。公司的项目根本不能体现我的价值，知道我价值的人，又不是能付钱给我的人。我退缩了，开始苦练 Leetcode。 我不再在开源项目投入很多时间，项目社区也渐渐失去了活力。放弃开源项目让我很难过，但我因此进入了一家大公司，我的薪水增加了5倍。 我把所有时间投入了公司的项目，得到了领导的好评。我的邮箱开始塞满了各种挖我跳槽的邮件。 但是，我知道，自己的技术退步了。公司的项目很枯燥，没有挑战性，使用的是内部技术栈。 此外，我也远不如以前快乐。 我想我会攒点钱，过几年就退休，希望那时开源世界还像以前一样。 言论 1、 AI 公司的融资有多么疯狂，前 OpenAI 公司首席科学家伊尔亚·苏茨克维在2024年筹集了10亿美元，几个月前又筹集了20亿美元，他的公司估值320亿美元。 据我所知，它唯一的产出就是网站上仅有的370个词，每个词价值8000多万美元，其中148个词还是关于合伙人离开公司的事情。不过，至少他还有个网站，有些创始人拿到钱以后简直销声匿迹了。 -- Substack 周刊 2、 保险公司十分担心，随着全球变暖、极端天气越来越多，资产的损失风险快速上升，世界正变得无法保险了。 -- 《世界很快将无法投保》 3、 Windows 11 的更新包，原本叫做春季包和秋季包。后来，有人反映，这不适用于南半球，就改名为 H1 更新包 和 H2 更新包。 -- 《为什么 Windows 更新包叫做 H1 和 H2》 4、 十多年来，编程训练营一直是硅谷的支柱产业。如今，AI 使得公司减少入门级职位的招聘，并且学生可以跟随 AI 自学，编程训练营正在逐渐消失。 -- 路透社 5、 人们以为自己在思考，其实是在重新编排自己的偏见。 -- 威廉·詹姆斯（William James），美国哲学家 往年回顾 《黑神话：悟空》可以产业化吗？（#314） Elasticsearch 的启示（#264） 你的地图是错的（#214） 培训班 vs 大学，求职成功率比较（#164） （完） 文档信息 版权声明：自由转载-非商用-非衍生-保持署名（创意共享3.0许可证） 发表日期： 2025年8月15日",
      "published": "Fri, 15 Aug 2025 08:04:36 +0800",
      "fetch_time": "2025-08-17T10:16:42.453321"
    },
    {
      "title": "科技爱好者周刊（第 360 期）：Dan Wang 的新书",
      "link": "http://www.ruanyifeng.com/blog/2025/08/weekly-issue-360.html",
      "summary": "这里记录每周值得分享的科技内容，周五发布。 本杂志开源，欢迎投稿。另有《谁在招人》服务，发布程序员招聘信息。合作请邮件联系（yifeng.ruan@gmail.com）。 封面图 今年年初开业的香港 Go Park 商业休闲综合体，空中俯视，就像任天堂游戏的地图。（via） Dan Wang 的新书 Dan Wang（我不知道他的中文名），7岁随家人移民北美，现在是知名的经济分析师，在斯坦福大学胡佛研究所任研究员。 他对中国问题的分析，非常有洞察力，在国外知识界很受重视。 2017年～2023年，他住在上海，并在国内各地旅行。 疫情后，他回到美国，开始专心写作一本关于中国的新书。上周，他宣布写完了，并且本月就要出版，书名叫做《冲：中国对未来的探索》（Breakneck: China's Quest to Engineer the Future）。 他在个人网站上，写了一篇长文，介绍这本新书，内容很有趣。下面是我的一点摘录。 1、 这本书始于2021年的一次旅行，我从贵阳骑行到重庆。 我欣喜地发现，重庆这个西部省份的基础设施，比加州或纽约要好得多，而后两个地方的富裕程度比重庆高出几个数量级。 在令人叹为观止的青山绿水间，五天的艰苦骑行让我瞥见了真正的中国。它远不止于高耸的桥梁、宏伟的基建，而是在进行一种前所未有的社会工程，试图解决这个国家面临的问题。 2、 2023年我回到美国，在耶鲁法学院待了一段日子。那里是精英法学院，是雄心勃勃、想要跻身美国政府高层的人的捷径。 这段日子让我强烈感受到，美国是一个律师社会。 律师在美国社会占主导地位，这促使美国沦为一个诉讼至上的否决制国家。无论你想做什么事，反对者都会试图通过律师来否决你。 我相信，如果美国如此执着于一个主要为富人和权贵阶层服务的体系，它就不可能继续保持强国地位。 3、 我逐渐形成了这样的观点：中国是一个工程国家，它用大型工程（包括社会工程）来解决物质和社会问题，而美国则是一个律师社会，它用法律阻止几乎所有的事情，无论好坏。 除此之外，美国人和中国人从根本上来说很相似：永不停歇，渴望走捷径，最终推动着世界上大多数重大变革。 中国和美国的竞争不应该用上个世纪的陈词滥调来解释，比如社会主义 vs 民主主义。两国经常以竞争的名义，实现那些最疯狂的梦想，探索自己的道路。 4、 \"工程国家\"与\"律师社会\"的对比，可以解释很多事情。 美国依赖法律手段，比如征收关税和设计各种严苛的制裁机制。而中国则专注于用工程创造未来，比如建造更好的汽车、更美丽的城市、更大规模的发电厂。 5、 工程师并非能言善辩，往往表达不出他们不理解的内容，所以尽管中国在海外修建了道路和桥梁，但它们难以激发中国在全球的文化吸引力。 6、 我写这本书，部分原因是为了整理自己对中国的看法。 中国建立了一个资源丰富国家的良好运营模式。它在过去四十年里修建了多少英里的公路、建造了多少座新的核电站、生产了多少钢铁，写出来真的令人震惊。 我认为，美国不必像中国那样去建设基础设施，只要达到法国、日本或西班牙的建设成本水平就足够了。 尽管如此，美国仍然应该向中国学习。中国在公共交通、充足的住房、功能齐全的城市建设方面已经取得了很多成功。 7、 美国太多地方感觉像是被完好保存下来的、曾经的伟大文明的遗迹。美国人应该更清晰地审视那些通常被忽视和蔑视的工业成就。 8、 2024年底，我再次去上海，发现消费降级是真实存在的。高档餐厅不再难以预订，川湘菜馆正在占据主导地位。许多餐厅的菜品都是在集中式配送中心制作的。越来越多的餐厅更注重外卖，而不是堂食。而且，似乎有一种趋势是，三线城市的连锁餐厅正在向一线城市迁移，以更便宜的价格提供略逊一筹的菜品。 最糟糕的是网红文化。中国的网红文化比美国浓厚得多。在公共场所，随处可见许多人对着手机自拍。任何迷人的地方，无论是咖啡馆还是山顶，都挤满了专心拍照的人。在中国，经常可以看到情侣或朋友聚餐时几乎不怎么互动，只是低头看着手机。我记得有一次在上海丽思卡尔顿酒店喝咖啡，一群女孩坐在我旁边，围着蛋糕互相拍照，竟然拍了一个多小时。网红文化促使餐厅的菜肴更注重拍照效果，而不是味道。 9、 我没有在这本书的任何部分使用 AI。一位经济学家曾写道，他人生中大约有一半时间没有接触过互联网，这让他在互联网出现后更能体会到它的价值。我突然想到，三十年后，回首往事，我也会发现自己的人生分成 AI 之前和 AI 之后。 为了更贴近 AI，我最近搬了家，从耶鲁大学来到斯坦福大学胡佛历史实验室，现在我是那里的研究员。我原本想留在纽约市，但湾区太有吸引力，我决定今年年底重新开始写我的年度信件。硅谷是一个和中国一样奇特而又引人注目的地方，我感觉搬到那里完全合适。 科技动态 1、美国最近创造了冷冻胚胎诞生时间最久的世界纪录。 1994年，一对不育症夫妻做了体外受精，一共培育了4个试管胚胎。他们自己用了一个，生下一个女儿，如今已经30多岁。 剩下的三个胚胎一直冷冻。今年，这对夫妇将其中一个胚胎，捐给了另一对不育症夫妻。 7月26日，这个婴儿顺利出生。理论上，他出生时就已经30岁了。 2、为了防止偷猎犀牛角，南非在每一头犀牛的角里面，植入放射性物质。 这些同位素对动物完全无害，但会使犀牛角被海关的辐射扫描仪检测到，从而抓到偷猎者。 南非的犀牛数量估计不多，否则不可能为每一头犀牛做植入手术。 3、美国内华达天文台，推出\"望远镜托管\"服务。 天文爱好者可以将自己的望远镜，托管在天文台的沙漠基地，观察条件远胜于城市，通过网络查看望远镜传回的影像。 天文台直接出售望远镜时间，是不是更有吸引力？我买下一小时的使用权，就可以网上操作真正的天文望远镜。 4、国际空间站庆祝运作25周年。人类已经在这个小小的太空舱，连续居住了25年。 5、一些用户在网上发帖，他们使用谷歌时，竟然遇到了弹框（下图）。 弹框要求用户同意，让谷歌使用他们生成的内容，否则某些高级功能将关闭。 以后，这可能成为常态，网站把用户的内容拿来训练 AI，如果用户不同意，就不能免费使用某些功能。 文章 1、达里奥·阿莫迪的故事（英文） 达里奥·阿莫迪（Dario Amodei，1983年出生）是 Anthropic 公司的创立者和首席执行官。本文是他的故事，一个生物学博士如何做出了 Claude AI。 2、硅谷的军事化（英文） 《纽约时报》的报道，硅谷科技公司正在不断加强与美军的合作。 它披露了一张令人震惊的照片。今年6月，美军特别为硅谷科技人员成立了一支技术创新部队，给予他们正式的军衔。上图为 Meta、OpenAI、Palantir 等四家公司的高管身穿军服，宣誓保卫美国。 3、Node.js 2025年的现代模式（英文） Node.js 已经发生了巨大的变化，本文介绍现在应该采用的新写法。 4、.gitignore 如何变成白名单（英文） .gitignore 默认是黑名单，会把指定文件排除出 Git 提交。本文教你把它改成白名单，只有提到的文件才能提交。 5、5个 Linux 基本命令的替代品（英文） Linux 的很多基本命令（cd、cat、ls、du、df 等）现在都有更好的替代品。 6、一道谷歌编程竞赛题（中文） 题目是\"(3 + 根号5) 的 n 次方\"最后三位整数是多少，我觉得非常难。（@longluo 投稿） 工具 1、Tinyauth 一个自架设的身份认证方案，支持密码、OAuth、TOTP 和 LDAP 等，要比同样免费的 Authelia 更简单易用。 2、copyparty 一个 Python 程序，将目录变成文件服务器，可以查看文件，支持 http、webdav、ftp 等多种协议。 3、Termix 一个自架设的 Web 服务，用来在网页上使用 SSH 连接远程服务器，让浏览器可以进行命令行操作，参见介绍文章。 4、packetd 查看网络数据包的命令行工具，支持解析多种网络协议，可以查看数据包来回的完整对话。（@chenjiandongx 投稿） 5、MiroTalk 基于浏览器 WebRTC 的在线视频通信开源解决方案，链接是多人视频会议版本，另有点对点通信版本、一对一通信版本。（@miroslavpejic85 投稿） 6、AppCub 制作手机 App 截图的在线工具。（@saviourdog 投稿） 7、PanSou 开源的网盘资源搜索 API 服务，提供聚合搜索服务，需要自己架设。（@fish2018 投稿） 8、Canarytoken 一个蜜罐服务，创造出各种虚假的 URL、DNS、数据库、二维码等等。一旦攻击者访问该资源，你就会得到通知。（@jerrylususu 投稿） 9、Pixel Motion 在线的像素图作图工具，可以同屏制作多个动画帧。（@YYsuni 投稿） 10、snapDOM 一个 JS 库，生成指定的 DOM 节点的截图。 AI 相关 1、AgentGuard 一个 JS 库，为 AI 操作设置费用限额，超出就中断进程。 2、Hyprnote 本地的 AI 会议助手，监听线上会议，自动生成会议笔记和总结。 3、Kitten TTS 一个 25MB 大小的 AI 语音模型，用来从文本生成语音。只使用个人电脑 CPU，几分钟就安装完毕，通过 Python 脚本使用，好像不支持中文，参见教程。 4、GithubStarsManager 用 AI 管理你的 GitHub Stars，自动对项目进行分类，支持自然语言搜索。（@AmintaCCCP 投稿） 5、Snippai 跨平台的 AI 智能截图工具，可以识别并提取公式、表格、代码、图片和文字。（@xyTom 投稿） 资源 1、SVG-LOGO 该网站收录中国国内的各种标志 LOGO 的 SVG 文件，目前有700多个。（@HeyHuazi 投稿）。 2、数学手册计算器（MathHand Calculator） 一个在线数学工具，包括数学手册、计算器、数学图形绘制等功能。（@DrHuangCom 投稿） 3、Linux 服务器加固指南（How To Secure A Linux Server） 这个英文仓库收录了启用 Linux 服务器以后的各种安全措施。 4、SVG 入门（英文） 一篇长文，介绍 SVG 格式的基础知识。 大模型的比较 国外媒体在2025年7月17日，对主流的大模型进行了测试。一共使用了225道题，看哪个模型得分更高，费用更省。 下图就是他们的测试结果。 纵轴是正确率，位置越高，表示模型的正确率越高。图中，位置最高的模型是 OpenAI 的 O3 pro。 横轴是成本，位置越靠左，表示成本越低。 综合来看，DeekSeek R1（0528）是一个比较均衡的模型：正确率够高，价格比同级别的模型都便宜。 文摘 1、验证的不对称性（asymmetry of verification） 验证的不对称性指的是，提出答案和验证答案的困难程度不对等。 某些问题找到答案很困难，但是验证答案是否正确非常容易。 数独就是一个例子，解题很难，但是一旦解出来，一眼就能看出是否正确。 再比如，做出 Instagram 这种复杂系统很难，但是做得对不对，用一下就知道了。 另一些问题正好反过来，找到答案相对容易，验证答案是否正确却很难。 比如，有人放出一个谣言，快速传播。辟谣很容易，发表一个声明就可以了。但是，想要消除谣言的影响（让每个人相信辟谣）就很难，往往要付出十倍百倍的资源。 再比如，有人说吃西兰花对身体有益。这样说很容易，但要验证这个说法至少需要数年时间。 AI 的出现，改变了验证的不对称性，因为 AI 让人们更容易找到答案，所以可以这样说： 所有可解决且易于验证的问题，都将被 AI 解决。 最终，只有那些难以验证答案的问题，AI 解决不了。 言论 1、 最糟糕的情况是，一个不懂编程的人使用 AI，编写出了一个需要长期维护的大型项目。这就好比把信用卡交给不懂事的孩子。 一旦代码出问题，如果你不理解代码，就只能让 AI 为你修复，这就像用一张信用卡偿还另一张信用卡的债务。 -- 《氛围编程是技术债》 2、 人们总幻想，自己的晚年身边充满了朋友、儿女、孙辈，以及一群热情洋溢的亲人。但是，真正的现实是，很多人的晚年是家人疏远或者不和，自身视力不佳、行动不便，甚至大小便失禁和痴呆。 日复一日地为每个孤独的人提供一个倾听者和诉说者，只有 AI 能做到。 -- 《AI 将解决孤独问题》 3、 面试的现场编码环节，考察的不是你的编程能力，而是抗压能力。 不擅长面试的现场编码，并不意味着你是一个糟糕的程序员，恰恰说明你是一个正常人。 -- 《现场编码很糟糕》 4、 我们只担心学生使用 AI 做作业，事实上，更应该担心的是教师使用 AI。 很多老师为了节省时间，正在用 AI 快速生成低质量、毫无意义的 PPT 和讲义。 -- 《教师使用 AI 正在失控》 5、 我这辈子认识的聪明人，没有一个是不大量读书的，一个也没有。巴菲特的阅读量之大，会让你大吃一惊。我的孩子们甚至嘲笑我，是一本伸出几条腿的书。 -- 芒格，著名投资家 往年回顾 如果新加坡没有空调（#313） 开源软件如何赚钱？（#263） 知识孤岛，知识软件（#213） 你的城市有多少张病床？（#163） （完） 文档信息 版权声明：自由转载-非商用-非衍生-保持署名（创意共享3.0许可证） 发表日期： 2025年8月 8日",
      "published": "Fri, 08 Aug 2025 08:06:51 +0800",
      "fetch_time": "2025-08-17T10:16:42.457260"
    },
    {
      "title": "科技爱好者周刊（第 359 期）：Palantir 值得关注",
      "link": "http://www.ruanyifeng.com/blog/2025/08/weekly-issue-359.html",
      "summary": "这里记录每周值得分享的科技内容，周五发布。 本杂志开源，欢迎投稿。另有《谁在招人》服务，发布程序员招聘信息。合作请邮件联系（yifeng.ruan@gmail.com）。 封面图 在湖南的一家工厂，工人们正在建造107米长的风力涡轮机叶片模具。（geosteinmetz@instagram） Palantir 值得关注 Palantir（中译帕兰提尔，或者帕兰泰尔）是一家美国的高科技公司。 它在中国不出名，但在美国鼎鼎大名。最近两年，股价涨了十几倍，市值达到4000多亿美元，排进世界前30大公司，高于三星。 它有鲜明的意识形态，自称使命是\"防止西方的衰落\"，要使用高科技，巩固自由民主制度，支持美国及其盟友。 它的业务主要是，接受美国政府和美军的订单，为它们做咨询和开发软件，提升美国的军事实力。 举例来说，它帮助美军在阿富汗识别路边的炸弹，帮助美国移民局发现非法移民，以及参与以色列的军事行动。 传说中，发现本拉登的藏身之处，也有它的功劳。它对此既不承认，也不否认。 它对于自己的业务和客户严格保密，从不泄漏，即使在美国，也是一家非常神秘的公司。 上周，我读到一篇 Palantir 离职员工的回忆文章，透露了很多公司的内部情况，很有意思，下面是一点摘录。真的极其特别，我觉得，大家应该关注这家公司。 1、 找工作的时候，我想找那种能够接触医疗保健、航空航天、安全等关键行业的工作，但又想要硅谷的工作文化，Palantir 基本上是唯一的选择。 我就是因为这一点加入的。 2、 刚进 Palantir 的时候，我发现里面充满了奇怪的人。事实上，如果你是一个怪咖，会更容易加入这家公司。 有一个同事，办公室放了好几个降低二氧化碳浓度的设备，杯子里还放了一大堆冰块，跟我交谈时，不停地嚼着冰块。据他说，这样可以促进认知能力。 3、 公司的 CEO 亚历克斯·卡普（Alex Karp）是一个哲学博士，面试候选人时，他喜欢没有任何资料直接面试，避免先入为主的成见。 他不看重候选人的经历，而会观察他们如何分解问题，能否从不同视角理解问题。 面试的问题通常与工作或软件无关，他甚至花了一个小时跟我讨论哲学家维特根斯坦。 4、 公司要求员工，同时具有宏大的知识背景和激烈的竞争精神，是具有奇思妙想的知识型思考者。 公司的各种制度，都是为了挑选出一种特定类型的人：独立思考，专注于目标，不会过度关注坏消息。 正是因为它招聘了众多优秀的、与众不同的员工，进而吸引了更多这样的人。 5、 它要求员工每周有3～4天去客户办公室，在那里工作，掌握复杂行业的业务流程和各种知识，然后运用这些知识，设计出能够真正解决问题的软件。 我的第一个客户是空中客车公司，我因此搬到法国图卢兹待了一年，每周四天在工厂与制造人员一起工作，在那里开发软件。 6、 公司的整体氛围，有点像一个要拯救世界的邪教团体，而非一家普通的软件公司。 但重要的是，它对批评非常宽容和欢迎。有人给我看了一封电子邮件，一位初级软件工程师正与公司一位董事进行公开的、激烈的争论，全公司（大约一千人）都抄送了这封邮件。 我对宗教不感兴趣，但喜欢看到，有人深切关注并探讨世界的发展方向，以及软件如何融入其中，这才是真正有趣的事情。 7、 公司的一个理念就是不给员工头衔，每个人的头衔都是\"项目工程师\"。除此之外，还有五六位董事和一位首席执行官。 原因是公司相信，如果创造出头衔，人们就会开始想要它，最终在公司滋生内部政治，破坏团结。最好还是给每个人同样的头衔，让大家专注于目标。 因为大家头衔都一样，也就没有等级，没有人可以指挥别人该做什么。你完全可以不在意别人，或者他怎么看你，直接无视他们，去做一些你认为正确的事情。 公司文化就是推崇无视上级的意见、但开发出了关键的基础设施的人。这种事在公司被当作榜样来效仿。 8、 \"无头衔\"的代价是，你常常感觉公司缺乏明确的战略或方向，更像是一个培养皿，里面的聪明人各自建立小领地，然后朝着随机的方向发展。 但这也带来了令人难以置信的创造力，人们低估了 Palantir 涌现出多少新颖的概念和想法。 AI 编程助手缺什么 大家使用 AI 编程助手，有没有感到，缺少一样东西？ 它们只有系统设置，没有管理后台，无法查看仪表盘和使用统计。 现在出来一个新的开源项目 MonkeyCode，就是带有管理后台的 AI 编程助手（下图）。 它有独立的服务端，可以私有化部署，支持纯离线使用。安装它的 VS Code 插件以后，AI 操作都会经过服务端，便于统一控制和统计。 它的后台可以配置 AI 模型，除了代码补全和生成，还能进行代码安全扫描。 用户使用时必须登录（上图），所有操作记录都会保存，很适合公司和团队了解每个成员怎么使用 AI。 它的代码在 GitHub，具体的安装/使用方法看官网文档。 科技动态 1、奔驰汽车宣布，将在车载电脑上，内置微软的远程会议软件 Teams。 你一边开车，一边参加线上会议。对方可以从车载摄像头看到你，但为了行驶安全，你在车内显示屏看不到对方，只能对话。 我有点想不通，如果真想在车内开会，手机打开 Teams，不就行了吗？ 2、美国食药局 FDA 本周批准了，世界第一种艾滋病疫苗，一年打两次，就不会感染艾滋病。 这种曾经无药可治的绝症，已经被解决了。 3、继推理模式之后，OpenAI 推出\"学习模式\"。用户输入一个学习主题，AI 会分解该主题，一步步教会用户。 国内公司估计很快跟进，打入利润丰厚的补习班行业。 相关消息还有，谷歌的 AI 笔记工具 NotebookLM，推出了视频功能，可以根据课本生成教课视频（下图）。 目前，它生成的视频就是 PPT 配上讲解音频。以后，只会照本宣读的老师，完全会被 AI 替代。 4、印度成为美国手机最大的供应国，占今年二季度市场份额的44%。第二是越南30%，第三是中国25%。 短短几年，印度就能搞定 iPhone，说明电子组装业真没有门槛，完全是劳动力行业。印度最大优势就是源源不断的廉价劳动力。 5、比利时安装了\"智能交通灯\"，它会根据路口的拥堵情况，智能切换红绿灯。 有意思的地方是，它不用摄像头判断车流，而是要求司机安装一个专门 App，开车时打开。系统读取路口的 App 的实例数，判断车流。 文章 1、浏览器用户指纹测试（英文） 我们知道，JS 脚本可以生成用户指纹，用来追踪用户。作者测试了 Chrome/Firefox/Tor，看看它们能否阻断用户指纹。默认情况下，只有 Tor 通过了测试。 2、为什么2025年仍然值得学习 Java（英文） 作者是一个资深 Java 程序员，向新人解释 Java 的优点。这门语言一直在进化，已经今非昔比。文章还给出了学习资源。 3、Python 脚本运行器 uv 教程（英文） uv 可以用来运行 Python 脚本，本文是一篇初学者教程。 4、邮件附件 PDF 文件的处理方案（英文） 很多邮件带有 PDF 附件（比如发票、合同），很难管理。 作者想出了一个解决方案，使用文档管理系统 Paperless-ngx 自动下载邮件，实现附件的分类、排序、搜索。 5、如何定制 Bash 环境（英文） 作者以自己为例，讲述怎么改造 Bash 环境，每次打开都会自动输出一个提醒（上图）。 6、CSS 的 font-size-adjust 属性（英文） 如果网页使用了多种字体，font-size-adjust 属性可以让它们看上去一样大小。 工具 1、Kelp 一个基于 Web Components 的网页组件库，提供网页样式的完整解决方案。 2、Ethersync 一个同步服务器，使用者安装后，再选择它的编辑器插件（NeoVim/VScode/Web），就可以实现编辑器同步。 3、Ansible Web 管理面板 提供 Ansible 的 Web 界面（批量主机管理、运行剧本任务、命令执行、文件传输和 Web 终端等）。（@sky22333 投稿） 4、WebSocket DevTools Chrome 开源插件，专门用于 WebSocket 调试，提供监控、拦截、模拟、收藏等功能。（@law-chain-hot 投稿） 5、PongHub 一个开源的服务监控平台，通过 GitHub Actions 去监控服务是否正常在线。（@WCY-dt 投稿） 6、TrendRadar 开源的新闻热点助手，通过 GitHub Pages 抓取国内11个主流平台的热点新闻，可以指定主题。（@sansan0 投稿） 7、MUSIX Rust 语言写的终端 MP3 播放器。（@coolcode 投稿） 8、ImageKit 批量图片处理的命令行工具，使用 Rust 语言编写。（@hzbd 投稿） 9、刷新率体验 一个 Web 应用，让用户拖动虚拟窗口，体验不同的屏幕刷新率造成的 UI 延迟，代码开源。（@MaskerPRC 投稿） 10、weekly-git-summary 一个命令行工具，根据 Git 提交记录生成周报。（@yinzhenyu-su 投稿） 11、Issue2File 一个 Go 语言编写的工具，一键将 GitHub 仓库的所有 issue 导出，保存为 Markdown 文件。（@ibarryyan 投稿） AI 相关 1、LandPPT 自搭建的 PPT 生成平台，支持多种 AI 模型，将文档内容转换为 PPT。（@sligter 投稿） 2、简历警察 AI 开发平台 Dify 的插件，让 AI 修改简历，具体的修改点可以参考它的提示词。（@Disdjj 投稿） 3、Belin Doc 免费的翻译站点，让 AI 翻译文档，可以保留格式，支持 PDF/PPTX/EPUB/DOCX 等多种文件（@K8S666 投稿） 4、Text Well 免费在线 AI 工具，用于修改润色文章。（@oil-oil 投稿） 5、AIClient-2-API 这个工具将 Google Gemini CLI 和 Kiro 客户端封装为本地 API 服务，提供 OpenAI 兼容接口，方便调用。（@justlovemaki 投稿） 6、Everything AI Chat Windows 文件搜索工具 Everything 的 AI 搜索客户端。（@MaskerPRC 投稿） 7、AIpex Chrome 的开源插件，使用 AI 一键整理标签页。（@buttercannfly 投稿） 资源 1、LangShift.dev 通过比较不同的计算机语言，学习新语言，源码开源。（@erweixin 投稿） 2、LaTeX 训练营 Latex 的免费中文课程，学习数学公式语法，在线动手练习，代码开源。（@prehisle 投稿） 图片 1、苹果的图标设计语言 苹果的图标，历史上不断演变，从拟物化到扁平化，再到液态玻璃。 词典 笔记本 App 商店 2、代数公式的图形化证明 大家在中学代数课程，都学过下面的基本公式。 a2 - b2 = (a + b) (a - b) 它可以用几何图形证明。 文摘 1、人们不再阅读完整内容 我很担忧，AI 的广泛应用，使得人们不再完整阅读任何内容。 人们以前就不愿意阅读长篇内容。长篇报告都会做成幻灯片，以求大家看一眼，即便如此，还要反复向听众强调幻灯片的重点内容。如果不这样做，人们一看到大段文字就会跳过去，最多看一眼图片。 现在有了 AI，人们就更不会阅读完整内容了。他们只会让 AI 去读，然后看一眼生成的内容总结。 视频、电视剧、电影也会如此。花两个小时看电影？太浪费时间了，让 AI 提炼出30秒的片段吧。 以后，看过原著的人越来越少，大家都看 AI 让我们看的东西。 言论 1、 学习自己真正想学的东西，最容易学进去，学习效果最好。做自己想做的事，最有动力，最有满足感。 这就是为什么你要锻炼意志力。只有意志坚强，你才能做出决定并付诸行动，选定自己的目标，去学去做。 -- 《用 AI 发展自己》 2、 对我来说，编程远不止是一项技能，而是一种探索、尝试和满足好奇心的方式。 我好几次放弃编程了，但最终都重新捡起。编程是我与世界互动的方式。 --《我为什么从事编程》 3、 迟早有一天，互联网将变成一个信息污水池，99%都是 AI 生成的信息污水，搜索引擎不再有效。 --《GPT 可能是一种信息病毒》 4、 我进入软件行业是因为我对此充满热情。十年后，大部分热情都消失了，我被敏捷开发的 Scrum 仪式和无休止的产品需求变更打败了。现在，我做完我的工作就会回家。 -- Hacker News 读者 往年回顾 从英特尔看\"美国制造\"（#312） 告别密码（#262） 人生不短（#212） 生活就像《吃豆人》游戏（#162） （完） 文档信息 版权声明：自由转载-非商用-非衍生-保持署名（创意共享3.0许可证） 发表日期： 2025年8月 1日",
      "published": "Fri, 01 Aug 2025 08:06:22 +0800",
      "fetch_time": "2025-08-17T10:16:42.461380"
    }
  ]
}